from src.cargo import Cargo
from src.container import Container
from src.parameters import Parameters
from src.population import Population

CARGOS = [
    [
        "1) Редуктор ВР-14",
        140,
        115,
        180,
        840
    ],
    [
        "2) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "3) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "4) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "5) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "6) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "7) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "8) Двигатель ТВ3-117ВМ",
        240,
        115,
        110,
        600
    ],
    [
        "9) Втулка несущего винта 8-1930-000 сер. 02",
        215,
        212,
        67,
        940
    ],
    [
        "10) Втулка несущего винта 8-1930-000 сер. 02",
        215,
        212,
        67,
        940
    ],
    [
        "11) Автомат перекоса 8-1950-000",
        105,
        125,
        100,
        280
    ],
    [
        "12) Хвостовой редуктор 246-1517-000",
        125,
        55,
        76,
        100
    ],
    [
        "13) Промежуточный редуктор 8А-1515-000",
        55,
        55,
        75,
        35
    ],
    [
        "14) Хвостовой вал 8А-1516-000",
        465,
        50,
        50,
        200
    ],
    [
        "15) Насос-регулятор НР-3ВМ-Т",
        65,
        55,
        50,
        45
    ],
    [
        "16) Рулевой винт 246-3904-000 сер. 01",
        55,
        50,
        55,
        100
    ],
    [
        "17) Лопасти 246-3925-000",
        182,
        50,
        50,
        70
    ],
    [
        "18) Рулевой винт 246-3904-000 сер. 01",
        55,
        50,
        55,
        100
    ],
    [
        "19) Лопасти 246-3925-000",
        182,
        50,
        50,
        70
    ],
    [
        "20) Рулевой винт 246-3904-000 сер. 01",
        55,
        50,
        55,
        100
    ],
    [
        "21) Лопасти 246-3925-000",
        182,
        50,
        50,
        70
    ],
    [
        "22) Рулевой винт 246-3904-000 сер. 01",
        55,
        50,
        55,
        100
    ],
    [
        "23) Вентилятор 8А-6311-00",
        60,
        60,
        60,
        50
    ],
    [
        "24) Гаситель вибрации 8АТ-1250-00",
        173,
        168,
        58,
        190
    ],
    [
        "25) Рычажная амортстойка переднего шасси 8А-4201-00А",
        170,
        50,
        50,
        60
    ],
    [
        "26) Карданный вал привода вентилятора 8А-6314-00",
        80,
        20,
        20,
        5
    ],
    [
        "27) Карданный вал привода вентилятора 8А-6314-00",
        80,
        20,
        20,
        5
    ],
    [
        "28) Комбнированный агрегат управления КАУ-30Б",
        75,
        45,
        45,
        30
    ],
    [
        "29) Комбнированный агрегат управления КАУ-30Б",
        75,
        45,
        45,
        30
    ],
    [
        "30) Генератор СГС-40ПУ",
        55,
        40,
        40,
        55
    ],
    [
        "31) Генератор СГС-40ПУ",
        55,
        40,
        40,
        55
    ],
    [
        "32) Генератор СГС-40ПУ",
        55,
        40,
        40,
        55
    ]
]

CONTAINERS = [
    [1, 23000, 925, 173, 163],
    [2, 23000, 925, 173, 163],
]

def main() -> None:
    cargos = [Cargo(*c) for c in CARGOS]
    containers = [Container(*c) for c in CONTAINERS]
    params = Parameters()
    
    population = Population(cargos, containers, params)
    
    population._next()


if __name__ == "__main__":
    main()
